In [42]:
import pandas as pd
import numpy as np

In [51]:
T043T = pd.read_excel("Script 12\T043T FI tolerance groups for employees.xlsx")

<>:1: SyntaxWarning: invalid escape sequence '\T'
<>:1: SyntaxWarning: invalid escape sequence '\T'
C:\Users\HIMANSHU SURYAVANSHI\AppData\Local\Temp\ipykernel_4740\730120059.py:1: SyntaxWarning: invalid escape sequence '\T'
  T043T = pd.read_excel("Script 12\T043T FI tolerance groups for employees.xlsx")

In [52]:
T043T.head()

,RFPRO,BUKRS,BETRS,BETRH,PROZS,PROZH,SKNTS,SKNTH,MAXBT,MAXEB,MAXSK
0,NaN,0001,100,100,10,10,10,10,"1,000,000,000,000.00","1,000,000,000.00",5
1,NaN,1000,1,1,10,10,10,5,9999999999999,"9,999,999,999.00",10
2,NaN,RECO,100,100,10,10,10,10,"1,000,000,000,000.00","1,000,000,000.00",5
3,NaN,REOB,100,100,10,10,10,10,"1,000,000,000,000.00","1,000,000,000.00",5
4,NaN,RERF,100,100,10,10,10,10,"1,000,000,000,000.00","1,000,000,000.00",5

In [53]:
T043T = T043T.rename(columns=lambda x: x.strip())

In [54]:
T043T.head()

,RFPRO,BUKRS,BETRS,BETRH,PROZS,PROZH,SKNTS,SKNTH,MAXBT,MAXEB,MAXSK
0,NaN,0001,100,100,10,10,10,10,"1,000,000,000,000.00","1,000,000,000.00",5
1,NaN,1000,1,1,10,10,10,5,9999999999999,"9,999,999,999.00",10
2,NaN,RECO,100,100,10,10,10,10,"1,000,000,000,000.00","1,000,000,000.00",5
3,NaN,REOB,100,100,10,10,10,10,"1,000,000,000,000.00","1,000,000,000.00",5
4,NaN,RERF,100,100,10,10,10,10,"1,000,000,000,000.00","1,000,000,000.00",5

In [55]:
T043T.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RFPRO   0 non-null      float64
 1   BUKRS   5 non-null      object
 2   BETRS   5 non-null      int64
 3   BETRH   5 non-null      int64
 4   PROZS   5 non-null      int64
 5   PROZH   5 non-null      int64
 6   SKNTS   5 non-null      int64
 7   SKNTH   5 non-null      int64
 8   MAXBT   5 non-null      object
 9   MAXEB   5 non-null      object
 10  MAXSK   5 non-null      int64
dtypes: float64(1), int64(7), object(3)
memory usage: 572.0+ bytes

In [56]:
T043T['BUKRS'].unique()

array(['0001', '1000', 'RECO', 'REOB', 'RERF'], dtype=object)

In [57]:
T043T = T043T[T043T['BUKRS'] == '1000']

In [58]:
T043T.head()

,RFPRO,BUKRS,BETRS,BETRH,PROZS,PROZH,SKNTS,SKNTH,MAXBT,MAXEB,MAXSK
1,NaN,1000,1,1,10,10,10,5,9999999999999,"9,999,999,999.00",10

In [65]:
T043T['MAXBT'].astype(str).str.count('\d')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\HIMANSHU SURYAVANSHI\AppData\Local\Temp\ipykernel_4740\216949872.py:1: SyntaxWarning: invalid escape sequence '\d'
  T043T['MAXBT'].astype(str).str.count('\d')

1    13
Name: MAXBT, dtype: int64

In [66]:
T043T = T043T[T043T['MAXBT'].astype(str).str.count('\d') >= 13]

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\HIMANSHU SURYAVANSHI\AppData\Local\Temp\ipykernel_4740\1809253319.py:1: SyntaxWarning: invalid escape sequence '\d'
  T043T = T043T[T043T['MAXBT'].astype(str).str.count('\d') >= 13]

In [67]:
T043T.head()

,RFPRO,BUKRS,BETRS,BETRH,PROZS,PROZH,SKNTS,SKNTH,MAXBT,MAXEB,MAXSK
1,NaN,1000,1,1,10,10,10,5,9999999999999,"9,999,999,999.00",10

In [68]:
T043T.to_csv("EDA12_new.csv", index=False)